{
    "head" : {
      "name" : "Junghwan Yim",
      "position" : "Graduate Student Researcher",
      "introduction" : "Data Scientist and Software Engineer solving problems with having broad data domain knowledge, development skills and deep understanding of AI, mathematical, or statistical modeling skills. Having experiences in analyzing, modeling, visualizing, and deploying various typed data as well as building the data pipeline, web, app service in both academic and industry fields. Having experiences leading teams or communities as a president or a project manager and achieving remarkable achievement with teams. Learn fast and solve problems by applying it by sharing what I learn with the team, thus maximizing the team's productivity."  
    },
    "education":[ 
        {
            "institution" : "University at Buffalo",
            "period" : "2016 - 2022",
            "degrees" : [
                "Master of Science in Physics",
                "Bachelor of Science in Computational Physics",
                "Bachelor of Science in Computer Science"
            ]
        },
        {
            "institution" : "State University at New York in Fredonia",
            "period" : "2013 - 2016",
            "degrees" : [
                "Bachelor of Science in Physics with Pre-Law",
                "Bachelor of Science in Business Administration (Music Industry)"
            ]
        }
    ],
    "certificates" : [
        {
            "title" : "Data Intensive Computing",
            "institution" : "University at Buffalo"
        },{
            "title" : "Probabilistic Graphical Model",
            "institution" : "Stanford University (Coursera)"
        }
    ],
    "award" :[ 
        {
            "title":"Meritorious Service Medal",
            "institution" : "Republic of Korea Personnel Command",
            "description" : "- Awarded in K-Startup Contest by designing and developing ingredient managing system and recipe recommend system from the commander of ROK Personnel Command, two-star rear admiral."
        },
        {
            "title":"Meritorious Service Medal",
            "institution" : "Republic of Korea Cyber Operation Command",
            "description" : "- Awarded for contribution and excellency by software development from the commander of ROK Cyber Operation Command, two-star rear admiral."
        }
    ],
    "career" :[ 
        {
            "career_title" : "Graduate Student Researcher",
            "period" : "01/2021 - present",
            "place" :  "University at Buffalo",
            "address" : "Buffalo, NY",
            "works" : [
                {
                    "title" : "2-Step Biometric Authentication by IMU Sensors at Phone and Watch",
                    "description" : [
                        "- Designed and developed authentication model with transfer funciton between watch and phone imu sensor data estimated with CycleGAN model and various signal processings and machine learning methods.",
                        "- Developed Android mobile and watch application to collect IMU sensor data, RTOS signal monitoring systema for other individual sensors conncected with bluetooth, and authentication application with the model",
                        "- Submitted this research to Mobisys 2022"
                    ]
                },
                {
                    "title" : "Model for Elevation Map Prediction and Synthesis",
                    "description" : [
                        "- Generated dynamic occupation maps and elevation maps distinguishing static object or dynamic object on the road from KITTI Dataset and ROS grid map package.",
                        "- Reduced computational cost by merging two different maps from vehicles with GAN model to predict the next frames of the maps."
                    ]
                },
                {
                    "title" : "Post-Processing for Static Object Detection (Traffic Sign Detection)",
                    "description" : [
                        "- Composed knowledge graph of static object on the road with leading object detection team in Autonomous Vehicle Laboratory of the University at Buffalo (CAVAS).",
                        "- Trained Yolo and RCNN models for traffic sign detection based on the knowledge graph and Mapiliary Traffic Sign Dataset, and the best model among models recorded 70% accuracy.",
                        "- Achieved stable and lighter detection performance using Kalman-Filter algorithm and calibration model and composed ROS package mapping detected the traffic signs and the distance with the traffic sign into HD (High Digital) Map with collaborating the CAVAS members."
                    ]
                }
            ]
        },
        {
            "career_title" : "Data Scientist / Software Developer",
            "period" : "05/2019 - 12/2020",
            "place" :  "Republic of Korea Cyber Operation Command",
            "address" : "Seoul, Republic of Korea",
            "works" : [
                {
                    "title" : "Developing Intelligence Operation System",
                    "description" : [
                        "- Developed an entire data-driven intelligence system (Data Pipeline) collecting data and assisting analysis using TensorFlow Server, Apache Ecosystem (Hadoop, Kafka, and Spark) and ELK stack with the operation and development team.",
                        "- Developed Natural Language Processing, Image Processing, Malware detection modules using Reverse Engineering, Machine Learning, Deep Learning, and Reinforcement Learning to analysis the collected data with TensorFlow, Keras, and Pytorch."
                    ]
                },
                {
                    "title" : "Designing Inventory Management and Recipe Recommend System",
                    "description" : [
                        "- Designed and developed demo for a data-driven recipes recommendation system for offering customized recipes based on the ingredients and user data.",
                        "- Improved recogniton model for ingredients in a refregiator by analyzing and Collecting user data and ingredients in their refregiator."
                    ]
                }
            ]
        }
    ],
    "projects" : [
        {
            "name" : "Tastie, Mobile Application",
            "description" : [
                "- Developed and operated a mobile application recommending restaurants based on the keywords to avoid suffering searching good restaurants, which in total reached 10K+ users in 2 months.",
                "- Analyzed keywords, user data, restaurant data collected by quantitating and qualitative methods to improve user experience.",
                "- Improved recommending system and user interface by the discovered insight in analysis."
            ]
        },
        {
            "name" : "Korean Society Webpage",
            "description" : [
                "- Developed Korean Society Webpage for Koreans in Buffalo, New York by leading Korean Students in various majors.",
                "- Got insights by analyzing users with survey, interviews and aggregated metrics from Google Analytics.",
                "- Made 300 user increments in a semester by grouping people and providing optimized services and contents for each sub-groups."
            ]
        },
        {
            "name" : "Rumour Detection with BERT and GCN",
            "description" : [
                "- Trained BERT and 3-layered GCN model classifying the stances of the text and comments of rumoureval 2019's Twitter and Reddit data and returning the probability of whether it is a rumor or not.", 
                "- Stance classification recorded an accuracy of 67%, and rumor detection recorded an accuracy of 70%.", 
                "- This study was selected as the best study in the Advanced Natural Language Processing class."
            ]
        }

    ],
    "skills" : [
        "Research", "ETL", "NLP", "Image Processing", "Machine Learning", "Deep Learning", "Reinforcement Learning",
        "Python", "R", "Scala", "SAS", "MATLAB", "SQL", "No-SQL",
        "numpy", "pandas", "seaborn", "scikit-learn", "Keras", "Pytorch", "TensorFlow", 
        "Elasticsearch", "Spark", "Hadoop", "Airflow", "Docker", "Kubernetes"
    ]
}